// eslint-disable-next-line
export const ru = {
  sidebar: {
    Profile: "Профиль",
    Messages: "Сообщения",
    Feeds: "Лента",
    Anime: "Аниме",
    Settings: "Настройки",
    Friends: "Друзья",
  },
  profile: {
    MyPosts: "Мои посты",
    YourNews: 'Твои новости...',
    Post: 'Поделиться',
    IlonaSue: 'Илона Сью',
    Response: 'Ответить',
    NoComments: 'Еще нет комментариев',
    AddComment: 'Добавить комментарий...',
    Add: 'Добавить'
  },
  dialogs: {
    FindUser: 'Найти пользователя',
    Start: 'Начать диалог...',
    SelectChat: 'Пожалуйста выберите диалог...',
    TypeMessage: 'Напиши свое сообщение здесь...',
  },
  feeds: {
    Filter: 'Сортировать:',
    Trends: 'Тренды',
    Manga: 'Манга',
    Fans: 'Фаны',
    News: 'Новости',
    ViewAll: 'Смотреть все'
  },
  anime: {
    ChooseAnime: 'Выбери свое аниме:',
    SearchAnime: 'Поиск аниме',
    WatchNow: 'Смотреть сейчас',
  },
  anime_list: {
    Naruto: 'Наруто',
    OnePiece: 'Ван Пис',
    MyHeroAcademia: 'Моя геройская академия',
    JujutsuKaisen: 'Моя магическая битва',
    TheSevenDeadlySins: 'Семь смертных грехов',
    BlackClover: 'Черный клевер',
    FairyTail: 'Хвост феи',
  },
  anime_description: {
    anime_1: `Наруто Узумаки, озорной подросток-ниндзя, сталкивается с трудностями в поисках признания и мечтает стать Хокаге — лидером деревни и сильнейшим ниндзя.`,
    anime_2: `Монки Д. Луффи отправляется в путешествие с командой пиратов в надежде найти величайшее сокровище — "One Piece".`,
    anime_3: `Мальчик, восхищающийся супергероями, поступает в престижную академию героев и узнает, что на самом деле значит быть героем, когда самый сильный супергерой дарует ему свои силы.`,
    anime_4: `Мальчик проглатывает проклятый талисман — палец демона — и сам становится проклятым. Он поступает в школу шаманов, чтобы найти другие части тела демона и тем самым изгнать проклятие.`,
    anime_5: `История Семь Смертных Грехов — группы воинов, которых несправедливо обвинили в преступлении, которого они не совершали, и они отправились в путешествие, чтобы оправдать себя.`,
    anime_6: `Аста и Юно были брошены в один и тот же храм и неразлучны с самого детства. В детстве они пообещали, что будут соревноваться друг с другом, чтобы узнать, кто станет следующим Императором Магии.`,
    anime_7: `Люси, стремящийся стать Целestialным Магистром, становится другом и союзником мощных магов Нatsu, Грея и Эрзы, которые являются частью (не)знаменитой магической гильдии "Fairy Tail".`,
  },
  user: {
    Name: "Илона Сью",
    DateOfBirth: "Дата рождения",
    City: "Город",
    Gender: "Пол",
    FavoriteAnime: "Любимое аниме",
  },
  contacts: {
    Sakura: 'Сакура',
    Sunny: 'Санни',
    Violet: 'Виолетта',
    Anna: 'Анна',
    Artur: 'Артур',
    Elon: 'Илон',
    Ino: 'Ино',
    Mark: 'Марк',
    Phillip: 'Филипп',
    Vikky: 'Викки',
    IlonaSue: 'Илона Сью'
  },
  friends: {
    MyFriends: 'Мои друзья',
    Description: `Здесь представлен список всех твоих друзей.`,
    Follow: 'Добавить',
    Unfollow: 'Удалить',
    Find: 'Найти пользователя'
  },
  settings: {
    PersonalAccount: "Личный аккаунт",
    Confidentiality: "Приватность",
    Language: "Язык",
    TermsAndPolicy: "Правила и условия",
    Help: "Помощь",
    Out: "Выход",
  },
  personal: {
    PersonalSettings: "Личные настройки",
    EditProfile: "Редактировать профиль:",
    Edit: "Редактировать",
    Save: "Сохранить",
  },
  confidentiality: {
    Confidentiality: "Приватность",
    ManagePrivacy: "Настройки приватности.",
    ProfileVisibility: "Видимость профиля:",
    DataSharing: "Делиться информацией:",
    AdPreferences: "Разрешить сбор информации:",
    ChooseWhoCanSeeYourProfileAndActivity:
      "Выбери кто может видить твой профиль.",
    ControlHowYourDataIsSharedWithThirdPartyServices:
      "Контролируй информацию которой будешь делиться с сервисами.",
    ManageAdPersonalizationBasedOnYourActivity:
      "Разрешить сбор информации о твоих интересах.",
    Public: "Открытый",
    Private: "Приватный",
    Friends: "Друзья",
    FriendsOnly: "Только друзья",
    AllowDataSharing: "Разрешить",
    DisableDataSharing: "Запретить",
    EnablePersonalizedAds: "Включить",
    DisablePersonalizedAds: "Отключить",
    Save: "Сохранить",
  },
  terms: {
    TermsAndPolicy: "Правила и условия",
    AccountResponsibility: "Ответственность за аккаунт",
    RespectfulBehavior: "Уважительное поведение",
    LegalUseOnly: "Только законное использование",
    NoSpamOrBots: "Запрещён спам и использование ботов",
    IntellectualProperty: "Интеллектуальная собственность",
    ContentGuidelines: "Руководство по содержимому",
    ReportingViolations: "Сообщение о нарушениях",
    ComplianceWithUpdates: "Соблюдение обновлений",
    ConsequencesOfViolations: "Последствия нарушений",
    AgeRequirement: "Возрастное ограничение",
  },
  terms_accordion: {
    term_2_1:
      "Пользователи должны предоставлять точную и актуальную информацию при создании аккаунта.",
    term_2_2:
      "Держите данные для входа в аккаунт в безопасности и не делитесь ими с другими.",
    term_2_3:
      "Немедленно сообщите нам, если подозреваете несанкционированный доступ к вашему аккаунту.",
    term_3_1:
      "Относитесь к другим пользователям с уважением и избегайте домогательств, буллинга или дискриминации.",
    term_3_2:
      "Не публикуйте и не делитесь контентом, который является оскорбительным, вредным или нарушает права других.",
    term_4_1: "Используйте платформу только в законных целях.",
    term_4_2: "Не занимайтесь деятельностью, нарушающей законы или правила.",
    term_5_1:
      "Не используйте платформу для рассылки спама, нежелательных сообщений или автоматизированных скриптов.",
    term_5_2:
      "Избегайте создания множества фальшивых аккаунтов или манипулирования системой.",
    term_6_1:
      "Не загружайте и не делитесь контентом, который нарушает авторские права, товарные знаки или другие права других лиц.",
    term_6_2:
      "Уважайте интеллектуальную собственность платформы и не копируйте, не изменяйте и не распространяйте её части.",
    term_7_1:
      "Убедитесь, что любой контент, который вы публикуете, соответствует стандартам сообщества и подходит для всех пользователей.",
    term_7_2:
      "Не делитесь откровенным или взрослым контентом, дезинформацией или фейковыми новостями.",
    term_8_1:
      "Сообщайте о подозрительном или вредоносном поведении нашей команде поддержки.",
    term_8_2:
      "Не злоупотребляйте инструментами для жалоб, чтобы преследовать или ложно обвинять других.",
    term_9_1:
      "Регулярно проверяйте обновления Условий и Политик и соблюдайте самые последние правила.",
    term_10_1:
      "Понимайте, что нарушения могут привести к предупреждениям, временной блокировке или постоянной блокировке аккаунта.",
    term_11_1:
      "Вы должны быть не младше [укажите минимальный возраст, например, 13 или 16 лет, в зависимости от платформы], чтобы использовать платформу.",
  },
  language: {
    LanguageSettings: "Настройки языка",
    InterfaceLanguage: "Язык интерфейса",
    Russian: "Русский",
    English: "Английский",
    PostTranslations: "Перевод постов",
    Checker: "Автоматически переводить посты",
    SaveChanges: "Сохранить изменения",
    en: 'Английский',
    ru: 'Русский',
  },
  help: {
    ContactSupport: "Связаться с нами",
    NeedHelp: "Нужна помощь?Свяжитесь с нами!",
    YourName: "Твое имя",
    YourMessage: "Твое сообщение",
  },
  log: {
    LogOut: "Вы уверены,что хотите выйти?",
    No: "Нет",
    Yes: "Да",
  },
  etc: {
    Empty: 'Ничего не найдено',
    Delete: 'Удалить',
    SendMessage: "Написать",
  }
};
